/*
    array_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
    array_2 = [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
    array_3 = [от 20 до 29]

    Сложение двух массимов
    Вычитание одного массимва из другого
    Умножение одного массива на другой
    Деление двух массимов
*/

/* Матрица 5x5
  - - - - - - - -
| 0  1  2  3  4  |
| 5  6  7  8  9  |
| 10 11 12 13 14 |
| 15 16 17 18 19 |
| 20 21 22 23 24 |
  - - - - - - - -

             Столбец 1 (ID 0) | Столбец 2 (ID 1) | Столбец 3 (ID 2) | Столбец 4 (ID 3) | Столбец 5 (ID 4)
Ряд 1 (ID 0)
Ряд 2 (ID 1)
Ряд 3 (ID 2)
Ряд 4 (ID 3)
Ряд 5 (ID 4)

matrix [0][0] = 0
matrix [2][4] = 14
*/